# dtypes in python

In [1]:
x = 5
print(type(x))

x = 20.5
print(type(x))

x = "This is a string"
print(type(x))

x = (2, 'This is a tuple')
print(type(x))

x = ['2', '3', '4']
print(type(x))

x = {"name" : "Vivek", "age" : 22}
print(type(x))

x = {"apple", "banana", "cherry"}
print(type(x))

x = True
print(type(x))

<class 'int'>
<class 'float'>
<class 'str'>
<class 'tuple'>
<class 'list'>
<class 'dict'>
<class 'set'>
<class 'bool'>

# Pandas and Numpy

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index

In [3]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)  # Create a Series from ndarray
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [4]:
print (s[0])  # Accessing Data from Series

a

In [8]:
print(s[2])

c

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

In [12]:
data = [['rahul',34],['laxman',32],['ashish',26]]
df = pd.DataFrame(data,columns=['Name','Age'], index=['player1','player2','player3'])
print(df)      # DataFrame from Lists

           Name  Age
player1   rahul   34
player2  laxman   32
player3  ashish   26

In [15]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

dfs = pd.DataFrame(d)
print(dfs)     # DataFrame from Dict of Series

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [16]:
df['Age']

player1    34
player2    32
player3    26
Name: Age, dtype: int64

In [17]:
# column deletion frm df
dfs.pop('two')
print(dfs)

   one
a  1.0
b  2.0
c  3.0
d  NaN

In [18]:
df.loc['player2']   # Rows can be selected by passing row label to a loc function

Name    laxman
Age         32
Name: player2, dtype: object

In [20]:
df.iloc[1]     # Rows can be selected by passing integer location to an iloc function

Name    laxman
Age         32
Name: player2, dtype: object

In [21]:
df = df.append(dfs)  # Add new rows to a DataFrame using the append function

In [22]:
df

           Name   Age  one
player1   rahul  34.0  NaN
player2  laxman  32.0  NaN
player3  ashish  26.0  NaN
a           NaN   NaN  1.0
b           NaN   NaN  2.0
c           NaN   NaN  3.0
d           NaN   NaN  NaN

In [24]:
# deletion of rows

df = df.drop('a')

In [25]:
df

           Name   Age  one
player1   rahul  34.0  NaN
player2  laxman  32.0  NaN
player3  ashish  26.0  NaN
b           NaN   NaN  2.0
c           NaN   NaN  3.0
d           NaN   NaN  NaN